youknowyg/sd_project/hy64app/Sources/mc9s12hy48.c
volatile PIFSSTR _PIFS;                                    /* Port S Interrupt Flag Register; 0x0000028B */
volatile PIE1ADSTR _PIE1AD;                                /* Port AD Interrupt Enable Register; 0x0000028C */
volatile PIF1ADSTR _PIF1AD;                                /* Port AD Interrupt Flag Register; 0x0000028D */
volatile PIERSTR _PIER;                                    /* Port R Interrupt Enable Register; 0x0000028E */
volatile PIFRSTR _PIFR;                                    /* Port R Interrupt Flag Register; 0x0000028F */
volatile PTUSTR _PTU;                                      /* Port U Data Register; 0x00000290 */
volatile PTIUSTR _PTIU;                                    /* Port U Input Register; 0x00000291 */
volatile DDRUSTR _DDRU;                                    /* Port U Data Direction Register; 0x00000292 */
volatile PERUSTR _PERU;                                    /* Port U Pull Device Enable Register; 0x00000294 */
volatile PPSUSTR _PPSU;                                    /* Port U Polarity Select Register; 0x00000295 */
volatile SRRUSTR _SRRU;                                    /* Port U Slew Rate Register; 0x00000296 */
volatile PTVSTR _PTV;                                      /* Port V Data Register; 0x00000298 */
volatile PTIVSTR _PTIV;                                    /* Port V Input Register; 0x00000299 */
volatile DDRVSTR _DDRV;                                    /* Port V Data Direction Register; 0x0000029A */
volatile PERVSTR _PERV;                                    /* Port V Pull Device Enable Register; 0x0000029C */
volatile PPSVSTR _PPSV;                                    /* Port V Polarity Select Register; 0x0000029D */
volatile SRRVSTR _SRRV;                                    /* Port V Slew Rate Register; 0x0000029E */
volatile TIM1_TIOSSTR _TIM1_TIOS;                          /* Timer Input Capture/Output Compare Select; 0x000002A0 */
volatile TIM1_CFORCSTR _TIM1_CFORC;                        /* Timer Compare Force Register; 0x000002A1 */
volatile TIM1_OC7MSTR _TIM1_OC7M;                          /* Output Compare 7 Mask Register; 0x000002A2 */
volatile TIM1_OC7DSTR _TIM1_OC7D;                          /* Output Compare 7 Data Register; 0x000002A3 */
volatile TIM1_TSCR1STR _TIM1_TSCR1;                        /* Timer System Control Register1; 0x000002A6 */
volatile TIM1_TTOVSTR _TIM1_TTOV;                          /* Timer Toggle On Overflow Register; 0x000002A7 */
volatile TIM1_TCTL1STR _TIM1_TCTL1;                        /* Timer Control Register 1; 0x000002A8 */
volatile TIM1_TCTL2STR _TIM1_TCTL2;                        /* Timer Control Register 2; 0x000002A9 */
volatile TIM1_TCTL3STR _TIM1_TCTL3;                        /* Timer Control Register 3; 0x000002AA */
volatile TIM1_TCTL4STR _TIM1_TCTL4;                        /* Timer Control Register 4; 0x000002AB */
volatile TIM1_TIESTR _TIM1_TIE;                            /* Timer Interrupt Enable Register; 0x000002AC */
volatile TIM1_TSCR2STR _TIM1_TSCR2;                        /* Timer System Control Register 2; 0x000002AD */
volatile TIM1_TFLG1STR _TIM1_TFLG1;                        /* Main Timer Interrupt Flag 1; 0x000002AE */
volatile TIM1_TFLG2STR _TIM1_TFLG2;                        /* Main Timer Interrupt Flag 2; 0x000002AF */
volatile TIM1_PACTLSTR _TIM1_PACTL;                        /* 16-Bit Pulse Accumulator A Control Register; 0x000002C0 */
volatile TIM1_PAFLGSTR _TIM1_PAFLG;                        /* Pulse Accumulator A Flag Register; 0x000002C1 */
volatile TIM1_OCPDSTR _TIM1_OCPD;                          /* Output Compare Pin Disconnect Register; 0x000002CC */
volatile TIM1_PTPSRSTR _TIM1_PTPSR;                        /* Precision Timer Prescaler Select Register; 0x000002CE */
volatile CPMUHTCTLSTR _CPMUHTCTL;                          /* High Temperature Control Register; 0x000002F0 */
volatile CPMULVCTLSTR _CPMULVCTL;                          /* Low Voltage Control Register; 0x000002F1 */
volatile CPMUAPICTLSTR _CPMUAPICTL;                        /* Autonomous Periodical Interrupt Control Register; 0x000002F2 */
volatile CPMUAPITRSTR _CPMUAPITR;                          /* Autonomous Periodical Interrupt Trimming Register; 0x000002F3 */
volatile CPMUHTTRSTR _CPMUHTTR;                            /* High Temperature Trimming Register; 0x000002F7 */
volatile CPMUOSCSTR _CPMUOSC;                              /* S12CPMU Oscillator Register; 0x000002FA */
volatile CPMUPROTSTR _CPMUPROT;                            /* S12CPMUV1 Protection Register; 0x000002FB */
/* NVFPROT - macro for reading non volatile register       Non Volatile P-Flash Protection Register; 0x0000FF0C */
/* NVDFPROT - macro for reading non volatile register      Non Volatile D-Flash Protection Register; 0x0000FF0D */
/* NVFOPT - macro for reading non volatile register        Non Volatile Flash Option Register; 0x0000FF0E */
/* NVFSEC - macro for reading non volatile register        Non Volatile Flash Security Register; 0x0000FF0F */


/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile PORTABSTR _PORTAB;                                /* Port AB Data Register; 0x00000000 */
volatile DDRABSTR _DDRAB;                                  /* Port AB Data Direction Register; 0x00000002 */
volatile PARTIDSTR _PARTID;                                /* Part ID Register; 0x0000001A */
volatile DBGTBSTR _DBGTB;                                  /* Debug Trace Buffer Register; 0x00000024 */
volatile TIM0_TCNTSTR _TIM0_TCNT;                          /* Timer Count Register; 0x00000044 */
volatile TIM0_TC0STR _TIM0_TC0;                            /* Timer Input Capture/Output Compare Register 0; 0x00000050 */
volatile TIM0_TC1STR _TIM0_TC1;                            /* Timer Input Capture/Output Compare Register 1; 0x00000052 */
volatile TIM0_TC2STR _TIM0_TC2;                            /* Timer Input Capture/Output Compare Register 2; 0x00000054 */
volatile TIM0_TC3STR _TIM0_TC3;                            /* Timer Input Capture/Output Compare Register 3; 0x00000056 */
volatile TIM0_TC4STR _TIM0_TC4;                            /* Timer Input Capture/Output Compare Register 4; 0x00000058 */
volatile TIM0_TC5STR _TIM0_TC5;                            /* Timer Input Capture/Output Compare Register 5; 0x0000005A */
volatile TIM0_TC6STR _TIM0_TC6;                            /* Timer Input Capture/Output Compare Register 6; 0x0000005C */
volatile TIM0_TC7STR _TIM0_TC7;                            /* Timer Input Capture/Output Compare Register 7; 0x0000005E */
volatile TIM0_PACNTSTR _TIM0_PACNT;                        /* Pulse Accumulators Count Register; 0x00000062 */
volatile ATDCTL01STR _ATDCTL01;                            /* ATD  Control Register 01; 0x00000070 */
volatile ATDCTL23STR _ATDCTL23;                            /* ATD  Control Register 23; 0x00000072 */
volatile ATDCTL45STR _ATDCTL45;                            /* ATD  Control Register 45; 0x00000074 */
volatile ATDCMPESTR _ATDCMPE;                              /* ATD  Compare Enable Register; 0x00000078 */
volatile ATDSTAT2STR _ATDSTAT2;                            /* ATD  Status Register 2; 0x0000007A */
volatile ATDDIENSTR _ATDDIEN;                              /* ATD  Input Enable Register; 0x0000007C */
volatile ATDCMPHTSTR _ATDCMPHT;                            /* ATD  Compare Higher Than Register; 0x0000007E */
volatile ATDDR0STR _ATDDR0;                                /* ATD  Conversion Result Register 0; 0x00000080 */
volatile ATDDR1STR _ATDDR1;                                /* ATD  Conversion Result Register 1; 0x00000082 */
volatile ATDDR2STR _ATDDR2;                                /* ATD  Conversion Result Register 2; 0x00000084 */
volatile ATDDR3STR _ATDDR3;                                /* ATD  Conversion Result Register 3; 0x00000086 */
volatile ATDDR4STR _ATDDR4;                                /* ATD  Conversion Result Register 4; 0x00000088 */
volatile ATDDR5STR _ATDDR5;                                /* ATD  Conversion Result Register 5; 0x0000008A */
volatile ATDDR6STR _ATDDR6;                                /* ATD  Conversion Result Register 6; 0x0000008C */
volatile ATDDR7STR _ATDDR7;                                /* ATD  Conversion Result Register 7; 0x0000008E */
volatile PWMCNT01STR _PWMCNT01;                            /* PWM Channel Counter 01 Register; 0x000000AC */
volatile PWMCNT23STR _PWMCNT23;                            /* PWM Channel Counter 23 Register; 0x000000AE */
volatile PWMCNT45STR _PWMCNT45;                            /* PWM Channel Counter 45 Register; 0x000000B0 */
volatile PWMCNT67STR _PWMCNT67;                            /* PWM Channel Counter 67 Register; 0x000000B2 */
volatile PWMPER01STR _PWMPER01;                            /* PWM Channel Period 01 Register; 0x000000B4 */
volatile PWMPER23STR _PWMPER23;                            /* PWM Channel Period 23 Register; 0x000000B6 */
volatile PWMPER45STR _PWMPER45;                            /* PWM Channel Period 45 Register; 0x000000B8 */
volatile PWMPER67STR _PWMPER67;                            /* PWM Channel Period 67 Register; 0x000000BA */
volatile PWMDTY01STR _PWMDTY01;                            /* PWM Channel Duty 01 Register; 0x000000BC */
volatile PWMDTY23STR _PWMDTY23;                            /* PWM Channel Duty 23 Register; 0x000000BE */
volatile PWMDTY45STR _PWMDTY45;                            /* PWM Channel Duty 45 Register; 0x000000C0 */
volatile PWMDTY67STR _PWMDTY67;                            /* PWM Channel Duty 67 Register; 0x000000C2 */
volatile SCIBDSTR _SCIBD;                                  /* SCI  Baud Rate Register; 0x000000C8 */
volatile SPIDRSTR _SPIDR;                                  /* SPI  Data Register; 0x000000DC */
volatile FCCOBSTR _FCCOB;                                  /* Flash Common Command Object Register; 0x0000010A */
volatile CANRXTSRSTR _CANRXTSR;                            /* MSCAN Receive Time Stamp Register; 0x0000016E */
volatile CANTXTSRSTR _CANTXTSR;                            /* MSCAN Transmit Time Stamp Register; 0x0000017E */
volatile MCPERSTR _MCPER;                                  /* Motor Controller Period Register; 0x000001C2 */
volatile MCDC0STR _MCDC0;                                  /* Motor Controller Period Register 0; 0x000001E0 */
volatile MCDC1STR _MCDC1;                                  /* Motor Controller Period Register 1; 0x000001E2 */
volatile MCDC2STR _MCDC2;                                  /* Motor Controller Period Register 2; 0x000001E4 */
volatile MCDC3STR _MCDC3;                                  /* Motor Controller Period Register 3; 0x000001E6 */
volatile MCDC4STR _MCDC4;                                  /* Motor Controller Period Register 4; 0x000001E8 */
volatile MCDC5STR _MCDC5;                                  /* Motor Controller Period Register 5; 0x000001EA */
volatile MCDC6STR _MCDC6;                                  /* Motor Controller Period Register 6; 0x000001EC */
volatile MCDC7STR _MCDC7;                                  /* Motor Controller Period Register 7; 0x000001EE */
volatile PTPRRSTR _PTPRR;                                  /* Port P Routing Register; 0x0000025E */
volatile TIM1_TCNTSTR _TIM1_TCNT;                          /* Timer Count Register; 0x000002A4 */
volatile TIM1_TC0STR _TIM1_TC0;                            /* Timer Input Capture/Output Compare Register 0; 0x000002B0 */
volatile TIM1_TC1STR _TIM1_TC1;                            /* Timer Input Capture/Output Compare Register 1; 0x000002B2 */
volatile TIM1_TC2STR _TIM1_TC2;                            /* Timer Input Capture/Output Compare Register 2; 0x000002B4 */
volatile TIM1_TC3STR _TIM1_TC3;                            /* Timer Input Capture/Output Compare Register 3; 0x000002B6 */
volatile TIM1_TC4STR _TIM1_TC4;                            /* Timer Input Capture/Output Compare Register 4; 0x000002B8 */
volatile TIM1_TC5STR _TIM1_TC5;                            /* Timer Input Capture/Output Compare Register 5; 0x000002BA */
volatile TIM1_TC6STR _TIM1_TC6;                            /* Timer Input Capture/Output Compare Register 6; 0x000002BC */
volatile TIM1_TC7STR _TIM1_TC7;                            /* Timer Input Capture/Output Compare Register 7; 0x000002BE */
volatile TIM1_PACNTSTR _TIM1_PACNT;                        /* Pulse Accumulators Count Register; 0x000002C2 */
volatile CPMUAPIRSTR _CPMUAPIR;                            /* Autonomous Periodical Interrupt Rate Register; 0x000002F4 */
volatile CPMUIRCTRIMSTR _CPMUIRCTRIM;                      /* S12CPMU IRC1M Trim Registers; 0x000002F8 */
/* BAKEY0 - macro for reading non volatile register        Backdoor Comparison Key 0; 0x0000FF00 */
/* BAKEY1 - macro for reading non volatile register        Backdoor Comparison Key 1; 0x0000FF02 */
/* BAKEY2 - macro for reading non volatile register        Backdoor Comparison Key 2; 0x0000FF04 */
/* BAKEY3 - macro for reading non volatile register        Backdoor Comparison Key 3; 0x0000FF06 */

/*lint -restore */

/* EOF */
